# TABLE JOINS

1. Inner Join
2. Left Join (Left Outer Join)
3. Full Join (Full Outer Join)
4. Cross Join
5. Left Semi Join
6. Anti Join

### SAMPLE DATASETS

```sql
-- create temporary tables
DROP TABLE IF EXISTS names;
CREATE TEMP TABLE names AS
WITH input_data (iid, first_name, title) AS (
 VALUES
 (1, 'Kate', 'Datacated Visualizer'),
 (2, 'Eric', 'Captain SQL'),
 (3, 'Danny', 'Data Wizard Of Oz'),
 (4, 'Ben', 'Mad Scientist'),
 (5, 'Dave', 'Analytics Heretic'),
 (6, 'Ken', 'The YouTuber')
)
SELECT * FROM input_data;

DROP TABLE IF EXISTS jobs;
CREATE TEMP TABLE jobs AS
WITH input_data (iid, occupation, salary) AS (
 VALUES
 (1, 'Cleaner', 'High'),
 (2, 'Janitor', 'Medium'),
 (3, 'Monkey', 'Low'),
 (6, 'Plumber', 'Ultra'),
 (7, 'Hero', 'Plus Ultra')
)
SELECT * FROM input_data;

DROP TABLE IF EXISTS new_jobs;
CREATE TEMP TABLE new_jobs AS
WITH input_table (iid, occupation, salary) AS (
 VALUES
 (1, 'Cleaner', 'High'),
 (1, 'Cleaner', 'Very High'),
 (2, 'Janitor', 'Medium'),
 (3, 'Monkey', 'Low'),
 (3, 'Monkey', 'Very Low'),
 (6, 'Plumber', 'Ultra'),
 (7, 'Hero', 'Plus Ultra')
)
SELECT * FROM input_table;
```

```sql
-- inspect names table
SELECT * FROM names;
```

| iid | first_name | title                |
|-----|------------|----------------------|
| 1   | Kate       | Datacated Visualizer |
| 2   | Eric       | Captain SQL          |
| 3   | Danny      | Data Wizard Of Oz    |
| 4   | Ben        | Mad Scientist        |
| 5   | Dave       | Analytics Heretic    |
| 6   | Ken        | The YouTuber         |

```sql
-- inspect jobs table
SELECT * FROM jobs;
```

| iid | occupation | salary     |
|-----|------------|------------|
| 1   | Cleaner    | High       |
| 2   | Janitor    | Medium     |
| 3   | Monkey     | Low        |
| 6   | Plumber    | Ultra      |
| 7   | Hero       | Plus Ultra |

```sql
-- inspect new_jobs table
SELECT * FROM new_jobs;
```

| iid | occupation | salary     |
|-----|------------|------------|
| 1   | Cleaner    | High       |
| 1   | Cleaner    | Very High  |
| 2   | Janitor    | Medium     |
| 3   | Monkey     | Low        |
| 3   | Monkey     | Very Low   |
| 6   | Plumber    | Ultra      |
| 7   | Hero       | Plus Ultra |

### 1. INNER JOIN

![inner join](https://i.imgur.com/1ijPQ4m.png)

```sql
SELECT
  names.iid,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
INNER JOIN jobs
  ON names.iid = jobs.iid;
```

| iid | first_name | title                | occupation | salary |
|-----|------------|----------------------|------------|--------|
| 1   | Kate       | Datacated Visualizer | Cleaner    | High   |
| 2   | Eric       | Captain SQL          | Janitor    | Medium |
| 3   | Danny      | Data Wizard Of Oz    | Monkey     | Low    |
| 6   | Ken        | The YouTuber         | Plumber    | Ultra  |

### 2. LEFT JOIN (LEFT OUTER JOIN)

![left join](https://i.imgur.com/XssVD8g.png)

```sql
SELECT
  names.iid,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
LEFT JOIN jobs
  ON names.iid = jobs.iid;
```

| iid | first_name | title                | occupation | salary |
|-----|------------|----------------------|------------|--------|
| 1   | Kate       | Datacated Visualizer | Cleaner    | High   |
| 2   | Eric       | Captain SQL          | Janitor    | Medium |
| 3   | Danny      | Data Wizard Of Oz    | Monkey     | Low    |
| 4   | Ben        | Mad Scientist        | null       | null   |
| 5   | Dave       | Analytics Heretic    | null       | null   |
| 6   | Ken        | The YouTuber         | Plumber    | Ultra  |

### 3. FULL JOIN (FULL OUTER JOIN)

![full join](https://i.imgur.com/5T64Wgv.png)

```sql
SELECT
  names.iid AS name_id,
  jobs.iid AS job_id,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
FULL JOIN jobs
  ON names.iid = jobs.iid;
```

| name_id | job_id | first_name | title                | occupation | salary      |
|---------|--------|------------|----------------------|------------|-------------|
| 1       | 1      | Kate       | Datacated Visualizer | Cleaner    | High        |
| 2       | 2      | Eric       | Captain SQL          | Janitor    | Medium      |
| 3       | 3      | Danny      | Data Wizard Of Oz    | Monkey     | Low         |
| 4       | null   | Ben        | Mad Scientist        | null       | null        |
| 5       | null   | Dave       | Analytics Heretic    | null       | null        |
| 6       | 6      | Ken        | The YouTuber         | Plumber    | Ultra       |
| null    | 7      | null       | null                 | Hero       | Plus Ultra  |

### 4. CROSS JOIN

![cross join](https://i.imgur.com/9m5rfQr.png)

```sql
SELECT
  names.iid as name_iid,
  jobs.iid as job_iid,
  names.first_name,
  names.title,
  jobs.occupation,
  jobs.salary
FROM names
CROSS JOIN jobs;
```

| name_id | job_id | first_name | title                | occupation | salary      |
|---------|--------|------------|----------------------|------------|-------------|
| 1       | 1      | Kate       | Datacated Visualizer | Cleaner    | High        |
| 1       | 2      | Kate       | Datacated Visualizer | Janitor	| Medium      |
| 1       | 3      | Kate       | Datacated Visualizer | Monkey     | Low         |
| 1       | 6      | Kate       | Datacated Visualizer | Plumber    | Ultra       |
| 1       | 7      | Kate       | Datacated Visualizer | Hero	    | Plus Ultra  |
| 2       | 1      | Eric       | Captain SQL          | Cleaner    | High        |
| 2       | 2      | Eric       | Captain SQL          | Janitor	| Medium      |
| 2       | 3      | Eric       | Captain SQL          | Monkey     | Low         |
| 2       | 6      | Eric       | Captain SQL          | Plumber    | Ultra       |
| 2       | 7      | Eric       | Captain SQL          | Hero	    | Plus Ultra  |
| 3       | 1      | Danny      | Data Wizard Of Oz    | Cleaner    | High        |
| 3       | 2      | Danny      | Data Wizard Of Oz    | Janitor	| Medium      |
| 3       | 3      | Danny      | Data Wizard Of Oz    | Monkey     | Low         |
| 3       | 6      | Danny      | Data Wizard Of Oz    | Plumber    | Ultra       |
| 3       | 7      | Danny      | Data Wizard Of Oz    | Hero	    | Plus Ultra  |
| 4       | 1      | Ben        | Mad Scientist        | Cleaner    | High        |
| 4       | 2      | Ben        | Mad Scientist        | Janitor	| Medium      |
| 4       | 3      | Ben        | Mad Scientist        | Monkey     | Low         |
| 4       | 6      | Ben        | Mad Scientist        | Plumber    | Ultra       |
| 4       | 7      | Ben        | Mad Scientist        | Hero	    | Plus Ultra  |
| 5       | 1      | Dave       | Analytics Heretic    | Cleaner    | High        |
| 5       | 2      | Dave       | Analytics Heretic    | Janitor	| Medium      |
| 5       | 3      | Dave       | Analytics Heretic    | Monkey     | Low         |
| 5       | 6      | Dave       | Analytics Heretic    | Plumber    | Ultra       |
| 5       | 7      | Dave       | Analytics Heretic    | Hero	    | Plus Ultra  |
| 6       | 1      | Ken        | The YouTuber         | Cleaner    | High        |
| 6       | 2      | Ken        | The YouTuber         | Janitor	| Medium      |
| 6       | 3      | Ken        | The YouTuber         | Monkey     | Low         |
| 6       | 6      | Ken        | The YouTuber         | Plumber    | Ultra       |
| 6       | 7      | Ken        | The YouTuber         | Hero	    | Plus Ultra  |

### 5. LEFT SEMI JOIN

![left semi join](https://i.imgur.com/XPoqNeY.png)

```sql
SELECT
  names.iid,
  names.first_name
FROM names
WHERE EXISTS (
  SELECT iid
  FROM new_jobs
  WHERE names.iid = new_jobs.iid
  );
```

| iid | first_name |
|-----|------------|
| 1   | Kate       |
| 2   | Eric       |
| 3   | Danny      |
| 6   | Ken        |

### 6. ANTI JOIN

![anti join](https://i.imgur.com/AYMkH4r.png)

```sql
SELECT
  names.iid,
  names.first_name
FROM names
WHERE NOT EXISTS (
  SELECT 1
  FROM new_jobs
  WHERE names.iid = new_jobs.iid
  );
```

| iid | first_name |
|-----|------------|
| 4   | Ben        |
| 5   | Dave       |